-- 고객 테이블에서 성이 김 씨인 고객의 고객이름, 나이, 등급, 적립금을 검색
SELECT 고객이름, 나이, 등급, 적립금 FROM 고객 WHERE 고객이름 LIKE '김%';

-- 고객 테이블에서 고객아이디가 5자인 고객의 고객아이디, 고객이름, 등급을 검색
SELECT 고객아이디, 고객이름, 등급 FROM 고객 WHERE 고객아이디 LIKE '_____';

-- 고객 테이블에서 나이가 아직 입력되지 않은 (즉, 나이 값이 NULL인) 고객의 이름을 검색
SELECT 고객이름 FROM 고객 WHERE 나이 IS NULL;

-- 고객 테이블에서 나이가 이미 입력된 (즉, 나이 값이 NULL이 아닌) 고객의 이름을 검색
SELECT 고객이름 FROM 고객 WHERE 나이 IS NOT NULL;

-- 고객 테이블에서 고객이름, 등급, 나이를 검색하되, 나이를 기준으로 내림차순 정렬하여 검색
SELECT 고객이름, 등급, 나이 FROM 고객 ORDER BY 나이 DESC;

-- 주문 테이블에서 수량이 10개 이상인 주문의 주문고객, 주문제품, 수량, 주문일자를 검색
-- 단, 주문제품을 기준으로 오름차순 정렬하고, 동일 제품은 수량을 기준으로 내림차순 정렬
SELECT 주문고객, 주문제품, 수량, 주문일자 FROM 주문 ORDER BY 주문제품 ASC, 수량 DESC;

-- # 집계 함수를 이용한 검색
-- 특성 속성 값을 통계적으로 계산한 결과를 검색하기 위해 사용하는 것이 집계 함수
-- 집계 함수는 열 함수라고도 하며, 개수, 합계, 평균, 최댓값, 최솟값의 계산 기능을 제공
-- * 주의사항: 집계 함수는 NULL인 속성 값은 제외하고 계산한다. 집계 함수는 WHERE 절에서는 사용할 수 없고, SELECT 절이나 HAVING 절에서만 사용 가능하다.

-- 제품 테이블에서 모든 제품의 단가 평균을 검색
SELECT AVG(단가) FROM 제품;

-- 한빛제과에서 제조한 제품의 재고량 합계를 제품 테이블에서 검색
SELECT SUM(재고량) AS "재고량 합계" FROM 제품 WHERE 제조업체='한빛제과';

-- 고객 테이블에 고객이 몇 명 등록되어 있는지 검색 / 고객아이디 속성 이용
SELECT COUNT(고객아이디) AS 고객수 FROM 고객;

-- 고객 테이블에 고객이 몇 명 등록되어 있는지 검색 / 나이 속성 이용
SELECT COUNT(나이) AS 고객수 FROM 고객;

-- 고객 테이블에 고객이 몇 명 등록되어 있는지 검색 / *를 이용
SELECT COUNT(*) AS 고객수 FROM 고객;

