-- 그룹별 검색
-- 주문 테이블에서 주문고객별 주문한 제품의 총주문수량을 검색하시오.
SELECT 주문고객, SUM(수량) AS 총주문수량
    FROM 주문
    GROUP BY 주문고객;

-- 주문 테이블에서 각 주문고객이 주문한 제품의 총주문수량을 주문제품별로 검색하시오.
SELECT 주문제품, 주문고객, SUM(수량) AS 총주문수량
    FROM 주문
    GROUP BY 주문제품, 주문고객;

-- 위 SQL문에 정렬을 추가하시오.
SELECT 주문제품, 주문고객, SUM(수량) AS 총주문수량
    FROM 주문
    GROUP BY 주문제품, 주문고객
    ORDER BY 주문제품 ASC;

-- 조인(Join) 검색
-- 주문, 제품 테이블 조인(부모 테이블의 외래키(FK)와 자식 테이블의 기본키(PK) 속성을 사용)
-- 자연 조인
-- 주문 테이블과 제품 테이블을 조인 검색 하시오.
SELECT * FROM 주문, 제품 WHERE 주문.주문제품=제품.제품번호;

-- 주문 테이블과 제품 테이블을 조인 검색 하시오. (주문번호, 주문고객, 제품명, 단가, 제조업체만 출력)
SELECT 주문번호, 주문고객, 제품명, 단가, 제조업체
    FROM 주문, 제품
    WHERE 주문.주문제품=제품.제품번호;
    
-- 주문 테이블과 고객, 제품 테이블을 조인 검색 하시오. (주문번호, 주문고객, 고객이름, 제품명, 단가, 수량, 제조업체만 출력)
SELECT 주문.주문번호, 주문.주문고객, 고객.고객이름, 제품.제품명, 제품.단가, 주문.수량, 제품.제조업체
    FROM 주문, 고객, 제품
    WHERE 주문.주문제품=제품.제품번호 AND 주문.주문고객=고객.고객아이디;

-- 주문 테이블의 결과에 제품명이 함께 출력되도록 검색하시오.
SELECT * FROM 주문; -- 이 행을 실행하면, 주문 테이블에 제품명이 나타나지 않는 것을 알 수 있다.
SELECT 주문.*, 제품.제품명 FROM 제품, 주문 WHERE 주문.주문제품=제품.제품번호;
SELECT 주문.주문번호, 주문.주문고객, 주문.주문제품, 제품.제품명, 주문.수량, 주문.배송지, 주문.주문일자 FROM 제품, 주문 WHERE 주문.주문제품=제품.제품번호;

-- apple 고객이 주문한 제품의 이름을 검색하시오.
SELECT 제품.제품명 FROM 제품, 주문 WHERE 주문.주문고객='apple' AND 제품.제품번호=주문.주문제품;

-- banana 고객이 주문한 제품의 이름을 검색하시오.
SELECT 제품.제품명 FROM 제품, 주문 WHERE 주문.주문고객='banana' AND 제품.제품번호=주문.주문제품;

-- 감자만두를 주문한 고객의 이름을 검색하시오.
SELECT DISTINCT 고객.고객이름 FROM 고객, 주문, 제품 WHERE 주문.주문고객=고객.고객아이디 AND 주문.주문제품=제품.제품번호 AND 제품.제품명='감자만두';

-- 고객, 주문 테이블 조인
-- 데이터베이스에서 나이가 30세 이상인 고객이 주문한 제품의 번호와 주문일자를 검색하시오.
SELECT 주문.주문제품, 주문.주문일자 FROM 고객, 주문 WHERE 고객.나이 >= 30 AND 고객.고객아이디=주문.주문고객;

-- 나이가 25세 이상인 고객이 주문한 제품의 번호, 주문일자, 고객이름을 검색하시오.
SELECT 주문.주문제품, 주문.주문일자, 고객.고객이름
    FROM 주문, 고객 
    WHERE 고객.나이>=25 AND 고객.고객아이디=주문.주문고객
    ORDER BY 주문제품 ASC;
    
-- 고명석 고객이 주문한 제품의 제품명을 검색하시오.
SELECT 제품.제품명 FROM 고객, 제품, 주문 WHERE 고객.고객이름='고명석' AND 제품.제품번호=주문.주문제품 AND 주문.주문고객=고객.고객아이디;

-- 정소화 고객이 주문한 제품의 제품명을 검색하시오. (단, 제품명이 한 번 씩만 나오게 하시오.)
SELECT DISTINCT 제품.제품명 FROM 고객, 제품, 주문 WHERE 고객.고객이름='정소화' AND 제품.제품번호=주문.주문제품 AND 주문.주문고객=고객.고객아이디;

-- 내부 조인(Inner Join)
-- 고객이 주문한 제품의 번호와 주문일자를 검색하시오. (단, 내부 조인으로 작성)
SELECT 고객.고객이름, 주문.주문제품, 주문.주문일자
    FROM 고객
    INNER JOIN 주문
    ON 고객.고객아이디=주문.주문고객;
    
-- 고객의 성이 정 또는 김 또는 고인 고객이 주문한 제품의 번호와 주문일자를 검색하시오. (단, 내부 조인으로 작성)
SELECT 고객.고객이름, 주문.주문제품, 주문.주문일자 FROM 고객 INNER JOIN 주문 ON 고객.고객아이디=주문.주문고객 WHERE 고객이름 LIKE '정%' OR 고객이름 LIKE '김%' OR 고객이름 LIKE '고%';

-- 외부조인(Outer Join)
-- 주문하지 않은 고객도 포함해서 고객이름, 주문제품, 주문일자를 검색하시오.
SELECT 고객이름, 주문제품, 주문일자 FROM 고객 LEFT OUTER JOIN 주문 ON 고객아이디=주문고객; -- 왼쪽 외부조인
SELECT 고객이름, 주문제품, 주문일자 FROM 주문 RIGHT OUTER JOIN 고객 ON 고객아이디=주문고객; -- 오른쪽 외부조인

-- Sub Query(부속 질의문)

-- 단일 행 부속 질의문
SELECT 제조업체 FROM 제품 WHERE 제품명='달콤비스킷';
SELECT 제품명, 단가 FROM 제품 WHERE 제조업체=(SELECT 제조업체 FROM 제품 WHERE 제품명='달콤비스킷');
SELECT 제품명, 단가 FROM 제품 WHERE 제조업체 IN (SELECT 제조업체 FROM 제품 WHERE 제품명='달콤비스킷');

-- 적립금이 가장 많은 고객의 고객이름과 적립금을 검색하시오.
SELECT 고객이름, 적립금 FROM 고객 WHERE 적립금=(SELECT MAX(적립금) FROM 고객);

-- 적립금이 가장 적은 고객의 고객이름과 적립금을 검색하시오.
SELECT MIN(적립금) FROM 고객;
SELECT 고객이름, 적립금 FROM 고객 WHERE 적립금=(SELECT MIN(적립금) FROM 고객);

-- 다중 행 부속 질의문
-- banana 고객이 주문한 제품의 제품명, 제조업체를 검색하시오.
SELECT 주문제품 FROM 주문 WHERE 주문고객='banana';
SELECT 제품명, 제조업체 FROM 제품 WHERE 제품번호 IN (SELECT 주문제품 FROM 주문 WHERE 주문고객='banana');

-- banana 고객이 주문하지 않은 제품의 제품명, 제조업체를 검색하시오.
SELECT 제품명, 제조업체 FROM 제품 WHERE 제품번호 NOT IN (SELECT 주문제품 FROM 주문 WHERE 주문고객='banana');

-- 대한식품이 제조한 모든 제품의 단가보다 비싼 제품의 제품명, 단가, 제조업체를 검색하시오.
SELECT 단가 FROM 제품 WHERE 제조업체='대한식품';
SELECT MAX(단가) FROM 제품 WHERE 제조업체='대한식품';
SELECT 제품명, 단가, 제조업체 FROM 제품 WHERE 단가 > ALL (SELECT 단가 FROM 제품 WHERE 제조업체='대한식품');